
{
    "status": "success",
    "totalResults": 277,
    "results": [
        {
            "title": "Michelin-starred chef sparks debate after claiming Pizza Express serve best pizza in capital",
            "link": "https://www.standard.co.uk/news/london/marcus-wareing-pizza-express-london-american-hot-b1095942.html",
            "keywords": [
                "London",
                "News"
            ],
            "creator": [
                "Sami Quadri"
            ],
            "video_url": null,
            "description": "Marcus Wareing owns three restaurants, including Marcus in Knightsbridge, which has received one Michelin star and five AA rosettes",
            "content": "Michelin-starred chef sparked a furious online debate after claiming that serve the best pizza in London. , who stars in MasterChef: the Professionals, also revealed that his favourite item on the menu is the “American Hot”, a pepperoni and paprika creation that comes with a choice of hot green or jalapeño peppers. Asked to name the “best pizza” by Jesse Burgess, who runs the Topjaw channel on , Wareing replied: “This one is easy, but you’re not going to like the answer. Pizza Express. I know, I know.” He added: “I still eat the same pizza I was eating for the past 20 years, American Hot, I love it. Romana, a little bit of extra chilli, I love it. It’s got to be a Romana base. And you know, every time I go it’s cooked the same.” SPONSORED The revelation sparked furious debate among London foodies. One person was left horrified, writing: “He should hand back his stars!” Another added: “Pizza Express?! Yuck! Shocked that such a respected chef rates it.” However, others were quick to endorse Wareing’s opinion. Perhaps unsurprisingly, Pizza Express’s corporate TikTok account chipped in with the reply: “Yes, chef!” “Love Pizza Express! Yes Wareing!”, another person wrote. It is not the first time that Wareing has extolled the virtues of the ubiquitous pizza chain. In 2012 he told Spear’s Magazine: “This may be a surprise but I am a regular at our local Pizza Express with our children and I think it is a fantastic business. I have tried other pizza restaurants but the service is lacking.” He added: “When I go here I know what I am getting, how long it will take, the kids love it and it gives me a day off from cooking.” Wareing owns three restaurants, including Marcus in Knightsbridge, which has received one Michelin star and five AA rosettes. His favourite pizza, the American Hot, costs £16.25. A spokesman for Pizza Express said: “Our iconic American Hot has long been a favourite with customers and now a Michelin-star chef, too. There will always be a marble table with Marcus’s name on it at Pizza Express.”",
            "pubDate": "2023-07-21 11:17:06",
            "image_url": "https://static.standard.co.uk/2023/07/21/11/newFile-7.jpg?width=1200&auto=webp",
            "source_id": "standarduk",
            "category": [
                "top"
            ],
            "country": [
                "united kingdom"
            ],
            "language": "english"
        },
        {
            "title": "9 food shopping hacks to help families cut costs",
            "link": "https://www.birminghammail.co.uk/black-country/9-food-shopping-hacks-help-27367582",
            "keywords": [
                "What's On"
            ],
            "creator": [
                "newsdesk@birminghamlive.co.uk (Kelly Ashmore)"
            ],
            "video_url": null,
            "description": "Rising food prices have made it harder to stick to strict budgets when it comes to the weekly big shop",
            "content": "The cost of living crisis has forced people to tighten their belts when it comes to splashing the cash. Families are now sticking to strict budgets when it comes to the weekly big shop, which is no easy task thanks to rising food prices. While many are swapping big brands for supermarkets' own ranges in a bid to save dosh, there are other savvy tricks families can use to slash costs. These include signing up for reward schemes and changing the time you hit the shops. Rebecca Bebbington, online consumer expert at NetVoucherCodes.co.uk said: “A weekly food shop can become very expensive very quickly but there are some things you can do to help keep the costs low. The cost of living hasn’t necessarily improved and many of us are still watching the pennies but that doesn’t mean you should have to compromise on the things you and your family love.\" READ MORE: How working parents could save £6,500 on childcare bills Below you'll find some top tips to cut down on food costs. If you've got any of your own, don't forget to share them in the comments section. Late night supermarket trips The supermarket's yellow sticker section can be chaotic at times but you may be able to bag the perfect bargain. With this in mind, it's probably best to take a trip to your local store in the evening or late Sunday afternoon to get the best reduction deals. Some cut-price items, like meat, can also be put in the freezer for future use. Bulk buy cupboard foods If something you use weekly is on offer, it might be wise to bulk buy. You won't have to worry about food wastage and you'll also save some cash. Places like Rogers Wholesale Foods in Bilston also sell food that is past its best-before date but still perfectly safe to eat. Recent offers include a case of 12 apple Fruit Shoots for £3, three boxes of Alpen muesli for £3 and seven pouches of Ella's Kitchen cauliflower cheese for £1. Get an online shop Not only could this save you money, but also time. Most supermarkets offer online shopping, which sees store staff pick your order and deliver it straight to your door. Some supermarkets have different deals online and they also offer a discount when you sign up for your first online shop. Switch it up and sign up for a different online shop each week to make the most of these deals. Ocado are currently offering customers 25 per cent off their first order . Make a list A simple yet effective tip, which allows you to stay on track. This way, you'll only buy what you need instead of throwing things into your trolley on a whim. Sign up for reward schemes Many supermarkets now offer a reward scheme, where you can earn points as you shop. Sign up for multiple schemes to get the most out of your spending. Morrisons More Card gives shoppers a £5 voucher when they reach 5,000 points, while Asda Rewards users buying 'star products' will get an 'instant cashpot boost', equivalent to 10 per cent of the item's price. Replace takeaways with fakeaways Takeaways can be an expensive treat, especially if you have a large family. Often you can recreate your favourites at home - and luckily the internet is full of fakeaway recipes. Find out how you can make a batch of iconic Black Country orange chips here and you'll only need six ingredients and an air fryer for this low-calorie stuffed crust pizza . Grab a 'magic bag' Those familiar with the Too Good To Go mobile app will know that you can buy so-called 'magic bags' of leftover food from shops, hotels and restaurants for a fraction of the price. With major retailers including Greggs, Toby Carvery, Harvester and Starbucks taking part, the app has become one of the biggest money-saving trends of late. You can read what happened when we secured a bag from Morrisons Cafe here . Batch cooking Classics like spaghetti bolognese, chilli con carne, cottage pie and soup can be batch cooked and stored in the freezer. They can be used as and when as speedy lunches and dinners. Uber Eats deal Social media has been full of savvy shoppers showing off their bargain Uber Eats hauls. Every Monday, app users can stock up their fridges and get 50 per cent off fruit and veg from Sainsbury's , Asda, Iceland and Morrisons Daily stores. While delivery and service fees apply, many feel it's worth it and \"still a very good price\".",
            "pubDate": "2023-07-21 10:57:15",
            "image_url": "https://i2-prod.birminghammail.co.uk/incoming/article24657464.ece/ALTERNATES/s615/0_Grocery-Prices-Reflect-Rising-Cost-Of-Living-In-UK.jpg",
            "source_id": "birminghammail",
            "category": [
                "entertainment"
            ],
            "country": [
                "united kingdom"
            ],
            "language": "english"
        },
        {
            "title": "Kids eat free: All the places kids eat free or for £1 during summer holidays - including Bella Italia and Asda",
            "link": "https://www.manchesterworld.uk/news/kids-eat-free-summer-holidays-ikea-asda-4227327",
            "keywords": [
                "News"
            ],
            "creator": [
                "Sam Johnson"
            ],
            "video_url": null,
            "description": "School is out for summer and to celebrate, plenty of supermarkets and restaurants are offering free or £1 meals for kids during the break - here is the full list.",
            "content": "School is out for summer and to celebrate, plenty of supermarkets and restaurants are offering free or £1 meals for kids during the break - here is the full list. As kids across the country celebrate the end of another school term, may be starting to worry about the cost of the summer holidays. However, there’s plenty of ways to take the young ones out and about at a cheap price this summer. From supermarkets including Asda and , to like Bella Italia and Hungry Horse, there’s plenty to choose from. Below is the full list of places kids can eat for free or £1 during the summer holidays - terms and conditions of any offers should always be checked. Advertisement Advertisement - In Asda Cafe, Kids eat for £1 every day until the end of the year, with no adult spend required. - Kids eat free in Tesco cafes when an adult spends as little as 60p and scans their Clubcard. This deal will start from July 24 and finish on September 1 in England and Wales. If you live in Scotland, the deal is live now until August 11, or if you live in Northern Ireland, it is available from now until September 1. - At Sainsbury’s cafes, kids eat for free with the purchase of an adult hot main meal costing £5.20 or more. This is available from 11.30am until September 3 - after this, kids can eat for £1. - At Morrisons, kids eat free, all day, every day when an adult purchases a main meal for £4.49 or more. Advertisement Advertisement - Two kids under 16 can get a free breakfast every day with one paying adult during the summer holidays. An adult breakfast costs £9.99 and is served until 10.30am every day. - At Hungry Horse, two kids eat for £1 on Mondays with every full paying adult. - Two kids eat for free per paying adult Monday to Friday at Farmhouse Inns. The deal runs from July 24 until September 8. - At Travelodge, two children eat breakfast for free when one adult buys a full priced breakfast. Breakfast is normally served every morning between 7am at 10am on weekdays, and between 8am and 11am during weekends and bank holidays. Advertisement Advertisement Two kids eat breakfast for free when one adult buys a full breakfast. Breakfast is normally served every morning from 6:30am until 10:30am on weekdays and from 7am until 11am during weekends and bank holidays. - Kids can eat for just £1 at any Sizzling Pub. The deal is every Monday to Friday, 3pm until 7pm, when an adult purchases a main meal. - Kids get a meal from 95p daily from 11am. Excludes IKEA Hammersmith and order and collection points. - Kids under 8 eat free all day, every day, at selected Gordon Ramsey restaurants with every paying adult. Available at Heddon Street Kitchen, all Bread Street Kitchen & Bars, Gordon Ramsay Bar & Grill, Pizza East and York & Albany. Advertisement Advertisement - Two kids eat free all day from July 24 until September 1 when one adult orders any main dish. Does not include Saturdays and Sundays. - At Bella Italia, Kids eat for £1 with any adult main meal. The offer is valid from 4pm until 6pm, Monday to Thursday. - Two kids under 16 eat for free with every adult breakfast purchased. - At Dunelm Pausa cafes, kids get one mini main, two snacks and a drink free with every £4 spent after 3pm. Advertisement Advertisement - Kids eat free with every £10 adult spend from July 17 until August 11.",
            "pubDate": "2023-07-21 10:50:57",
            "image_url": "https://www.manchesterworld.uk/jpim-static/image/2023/07/21/11/AdobeStock_457993612.jpeg?width=1200&auto=webp",
            "source_id": "manchesterworld",
            "category": [
                "top"
            ],
            "country": [
                "united kingdom"
            ],
            "language": "english"
        },
        {
            "title": "Cost of junk food in supermarkets soars by up to 60% despite overall food price rises starting to slow",
            "link": "https://www.dailymail.co.uk/money/bills/article-12315019/Cost-junk-food-supermarkets-soars-60-despite-overall-food-price-rises-starting-slow.html?ns_mchannel=rss&ns_campaign=1490&ito=1490",
            "keywords": null,
            "creator": null,
            "video_url": null,
            "description": "The price of pizza and quiche has shot up a whopping 61 per cent in the year to June, while chocolate is up 45 per cent and crisps have risen 9 per cent.",
            "content": "Cost of junk food in supermarkets soars by up to 60% despite overall food price rises starting to slow Pizza, chocolate and crisps are the items which rose the fastest in price The majority of food items have dropped in price, ONS data shows Household staples like butter have been slashed as much as 50% By Helen Kirrane Updated: 06:44 EDT, 21 July 2023 e-mail View comments The price of junk food in supermarkets like pizza, crisps and chocolate is rising far faster than healthier options, hitting households who want to buy treats for their families. The overall price of food rose 17.3 per cent in the year to June 2023, down from 18.3 per cent in May, according to the latest consumer prices index (CPI) inflation figures from the Office for National Statistics. But delving into the June price hikes for individual foodstuffs reveals that the cost of treats is rising faster than the month before, whereas price rise of most other items have started to slow. For example, the price of pizza and quiche has shot up a whopping 61 per cent, chocolate is up 45 per cent and crisps have risen 9 per cent. Soaring: The cost of junk food has soared by up to 60%, new ONS figures reveal, while most other food price rises have started to fall Jam, syrups and confectionery have risen by 18 per cent and soft drinks are up 19 per cent. The reason items such as chocolate, jam and syrups are rising is largely due to increasing sugar prices. Sugar prices are at a 10-year high due to shortages and poor weather in many sugar-growing regions, such as Europe, Brazil and Thailand. That in turn pushes up the prices of food and drinks that use a lot of sugar. RELATED ARTICLES Previous 1 Next Food prices are soaring - How to save money when doing... Why has inflation fallen and what does it mean for you? High food prices and price shocks may be sign of things to... A third don't have emergency funds as inflation forces... Share this article Share HOW THIS IS MONEY CAN HELP The top savings deals to help fight the effects of inflation on your money Harvir Dhillon, economist at the British Retail Consortium (BRC), said: 'Sugar prices have been rising over the past few months. Most recently, they’ve been impacted by production bottlenecks in key producer nations. 'As a result, the lower export availabilities of sugar have not been enough to satisfy the strong global demand.' A BRC spokesperson said the organisation had no data on why the price of crisps, pizzas and quiches are rising so fast. However, this may also be due to price hikes for the ingredients needed to make them. Oil and cheese prices have seen some of the steepest price increases of any foods during the cost of living crisis. The price of oils and fats used for frying rose 23.1 per cent in the year to June 2023. Likewise, potato prices increased by 19.1 per cent in the same period. Meanwhile cheese increased by 25.1 per cent in price, while flour used to make pizza bases is up by 17.6 per cent. SAVE MONEY, MAKE MONEY Top micro-fix Micro fixed rate Three-month fixed savings at 4.89%* Sign-up via HL savings platform. Easy access saving Easy access saving Competitive 4.51% interest rate* Deposit from £1 Interest paid monthly Fibre broadband * £50 Amazon voucher on sign-up £50 Amazon voucher sign-up* 24 months at £32 per month One-year fix One-year fixed saving Competitive 6.01% interest rate* Deposit from £5,000 via Raisin UK Broadband Broadband £100 Amazon voucher* £31 per month for 24 months * Affiliate links: If you take out a product This is Money may earn a commission. These deals are chosen by our editorial team, as we think they are worth highlighting. This does not affect our editorial independence. Share or comment on this article: Cost of junk food in supermarkets soars by up to 60% despite overall food price rises starting to slow e-mail Add comment Some links in this article may be affiliate links. If you click on them we may earn a small commission. That helps us fund This Is Money, and keep it free to use. We do not write articles to promote products. We do not allow any commercial relationship to affect our editorial independence. Toggle Search POPULAR MONEY SECTIONS Take me to… Best savings rates tables Find the best mortgage calculator Power Portfolio investment tracker Stock market data and share prices This is Money's podcast This is Money's newsletter The best DIY investing platforms The best bank accounts The best cash Isas The best credit cards Save on energy bills Compare broadband and TV deals How to find cheaper car insurance Investing Show videos Financial calculators Search Enter search term Search Search within All articles Share prices Comments 0 Share what you think No comments have so far been submitted. Why not be the first to send us your thoughts, or debate this issue live on our message boards. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy . More top stories",
            "pubDate": "2023-07-21 10:44:08",
            "image_url": "https://i.dailymail.co.uk/1s/2023/07/19/17/73392597-0-image-m-16_1689783693449.jpg",
            "source_id": "dailymailuk",
            "category": [
                "business"
            ],
            "country": [
                "united kingdom"
            ],
            "language": "english"
        },
        {
            "title": "Molly McCann was given 'Meatball' nickname after working in Subway, loves Guinness and co-owns a new Italian restaurant... but she has weight cutting and diet down to a fine art as she hits scales ahead of UFC London",
            "link": "https://www.dailymail.co.uk/sport/mma/article-12323203/Molly-McCann-given-Meatball-nickname-working-Subway-loves-Guinness-owns-new-Italian-restaurant-weight-cutting-diet-fine-art-hits-scales-ahead-UFC-London.html?ns_mchannel=rss&ns_campaign=1490&ito=1490",
            "keywords": null,
            "creator": null,
            "video_url": null,
            "description": "You might expect a fighter nicknamed 'Meatball' to struggle when it comes to hitting the mark on the UFC scales. But Molly McCann, who clocked in at 125-pounds on the dot on Friday, is a professional.",
            "content": "Molly McCann was given 'Meatball' nickname after working in Subway, loves Guinness and co-owns a new Italian restaurant... but she has weight cutting and diet down to a fine art as she hits scales ahead of UFC London Molly McCann was given 'Meatball' nickname when she worked at Subway She likes to indulge outside of training camps and co-owns Italian restaurant But 'Meatball' now has weight cutting and dieting down to a fine art By Will Griffee For Mailonline Updated: 11:43, 21 July 2023 e-mail 6 View comments You might expect a fighter nicknamed 'Meatball' to struggle when it comes to hitting the mark on the UFC scales. But Molly McCann, who clocked in at 125-pounds on the dot on Friday morning ahead of her co-main event in London, has weight cutting and diet down to a fine art - only cheated once at Paddy Pimblett's wedding . It hasn't always been so easy for McCann, who previously described herself as a 'skinny fat thing' and was given the nickname 'Meatball' when she worked at Subway, long before she emerged as a cherished fan favourite in the UFC. In fact, she missed weight on her UFC debut and had to sacrifice 20 per cent of her purse as punishment. It embarrassed her at the time and said: 'I won't give you an excuse, I have never missed weight in 29 fights, and today is the first time I have. On my part I'd like to apologise, I didn't give up, I stayed cutting until the final moment. Molly McCann made weight on Friday morning ahead of her co-main event at UFC London 'Meatball' now co-owns her own Italian restaurant in Liverpool called Polpetta McCann has diet and weight cutting down to a fine art and has only missed the mark once The co-maineventers Molly McCann and Tom Aspinall have weighed in ahead of UFC Fight night at the O2 Arena ¿¿ #UFCLondon pic.twitter.com/uRYXf7fTj2 — Mail Sport (@MailSport) July 21, 2023 'I would also like to apologise to the fans. No excuses, the fight goes ahead and tomorrow I get to make up for the lack of professionalism.' And that was the one only one blot on her otherwise spotless copybook. Outside of training camps, McCann is known to like a Guinness and a night out, all part of the relatable charm that has made her so popular. McCann recently told the Telegraph which super-power she'd choose, saying: 'To teleport. I’d want to go to the Guinness Storehouse in Dublin and have a nice pint. That’s where I want to be right now. I always love a good Guinness. And of her dream dinner: 'I’d have pil pil prawns to start and my main would be carbonara – I love pasta. Dessert would be something like cookie dough. 'I’d invite Gordon Ramsay or Gino D’Acampo because we’d end up having a laugh. Me and Gino would definitely have a laugh – we wouldn’t be able to understand each other.' She also recently founded an Italian restaurant in Liverpool called 'Polpetta' that she co-owns. At the launch event she told the Echo: 'Ten years ago, I was working in the Subway on Bromley Street and it's where I got my name. Looking at this now, I'm just completely blown away by the city showing up for me. 'This isn't just a flash in the pan. [Joel and I] worked so hard on this, on brand, the menu, the ingredients the taste, and we've brought the best little group of chefs together that we can find. It's really nice to know that the city has shown up to support me like this. McCann missed weight on her UFC debut but has never repeated the same mistake McCann, pictured after a win with Paddy Pimblett last year, is in elite fighting shape The 33-year-old added: 'We went for a drink and we came for a Guinness. We actually wanted to open a butcher's, something like Molly's meats house, but then we thought, 'What's was our favourite food?' and it's Italian - I'm the meatball, let's do this. 'We'd meet every Thursday in Punch Tarmey's for a Guinness and we'd come up with a little bit more on a little bit more.' Avoiding too much over-indulgence on her own produce and steering clear of the Guinness is of course key to McCann getting in tip top shape during training camps. She lit up London twice last year with two incredible knockouts coming from spinning elbows and is gunning for the same result against Julija Stoliarenko on Saturday night. Her weight-cutting has developed over the years and McCann is now guided by a specialist company called Applied Nutrition. 'Sports science changed my life in a really positive way,' she explains. 'I literally felt that I'd hit the jackpot, my mental health was in the bin after losing my first fight but sports science brought me back. 'Previously if I didn't feel like I was absolutely exhausted after every session then I didn't think I was training hard enough. 'Now I know I was putting my body under too much stress and not recovering well. 'Normally I'd cut 14lbs in fluid on fight week. I was a skinny fat thing, but to look at me you'd still think I was in good shape. 'I made the weight the night before with none of that. I have to credit all the staff for getting me in that shape.' Now the weight cut is a streamlined process and where some fighters have to wrap themselves in foil in a sauna and brutalise their bodies to sweat down to the correct limit, McCann yesterday spoke about how she was even able to eat carbohydrates the day before the weigh-ins. The Liverpool fan favourite was blown away by the reception to her Italian restaurant opening McCann was seen drinking whiskey from the bottle after her victory last year Away from the rigorous discipline in training camp and calories counted, McCann is the life of the party when the shackles can come off. She famously yelled into the mic after a win: 'I just want a bevvy, lad!' And she started downing a bottle of Howler Head whiskey after her win against Luana Carolina last year, thrilling the crowd. 'Meatball' still had the bottle with her in the post-fight press conference, admitting she was 'bladdered', alongside Paddy Pimblett, who was scoffing a pizza. In the hours ahead, McCann will be rehydrating and fuelling up for the battle ahead. It will be her first event co-main event spot on a UFC card and the spotlight is shining ever brighter at the O2 Arena. The venue has been a happy hunting ground for McCann in the past and she'll be hoping to devour Stoliarenko before heading back to Liverpool to continue the feasting. Share or comment on this article: Molly McCann was given 'Meatball' nickname after working in Subway, loves Guinness and co-owns a new Italian restaurant... but she has weight cutting and diet down to a fine art as she hits scales ahead of UFC London e-mail Add comment Comments 6 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .",
            "pubDate": "2023-07-21 10:43:48",
            "image_url": "https://i.dailymail.co.uk/1s/2023/07/21/10/73464261-0-image-a-4_1689932055879.jpg",
            "source_id": "dailymailuk",
            "category": [
                "sports"
            ],
            "country": [
                "united kingdom"
            ],
            "language": "english"
        },
        {
            "title": "Wer aller mitverdient - So entstehen die Wucherpreise bei Lebensmitteln",
            "link": "https://www.krone.at/3003647",
            "keywords": null,
            "creator": null,
            "video_url": null,
            "description": "Wenn der Markt nicht funktioniert, muss die Politik eingreifen. Das hat der Ministerrat mit einem Paket gegen die Teuerung zwar auch gemacht. Doch viel spürbar ist davon noch nicht. Die Preise für Nahrungsmittel sind aktuell im Schnitt um zwölf Prozent gestiegen und damit stärker als die durchschnittliche Teuerung mit neun Prozent. Wir zeigen, wie hier gearbeitet wird.",
            "content": "Wenn der Markt nicht funktioniert, muss die Politik eingreifen. Das hat der Ministerrat mit einem Paket gegen die Teuerung zwar auch gemacht. Doch viel spürbar ist davon noch nicht. Die Preise für Nahrungsmittel sind aktuell im Schnitt um zwölf Prozent gestiegen und damit stärker als die durchschnittliche Teuerung mit neun Prozent. Wir zeigen, wie hier gearbeitet wird. Die Arbeiterkammer kritisiert, dass selbst vormals preisgünstige Produkte schon seit längerer Zeit viel mehr kosten und es auch bei den schon teureren Markenprodukten kräftige Preiserhöhungen gibt. Dabei seien die Preise sowohl im Lebensmittel- als auch im Drogeriehandel und in den Online-Shops gestiegen, zeigt der AK-Preismonitor . Eine preisgünstige Pizza koste nun um knapp das Doppelte mehr als noch im Juni des Vorjahres, günstige Marillenmarmelade für Palatschinken sei um fast 123 Prozent teurer als noch 2022. Bei einem preiswerten Nagellackentferner und einer Haarspülung machte die Arbeiterkammer eine Steigerung von rund 300 Prozent aus. Aber auch Markenprodukte wie Wiener Zucker von Agrana (+61%) oder Ölz-Toast (+31%) wurden gegenüber dem Vorjahr noch einmal teurer. Doch wie kommt es eigentlich diese Preistreiberei? Prinzipiell entsteht der Preis für Butter, Brot, Obst, Gemüse und Fleisch nach dem Gesetz von Angebot und Nachfrage. Bis die Lebensmittel aber von der Produktion über das Supermarktregal beim Endverbraucher landen, gilt es die Kosten entlang der Lebensmittelkette zu verstehen. Willkommen in unserer Community! Eingehende Beiträge werden geprüft und anschließend veröffentlicht. Bitte achten Sie auf Einhaltung unserer Netiquette und AGB . Für ausführliche Diskussionen steht Ihnen ebenso das krone.at-Forum zur Verfügung. User-Beiträge geben nicht notwendigerweise die Meinung des Betreibers/der Redaktion bzw. von Krone Multimedia (KMM) wieder. In diesem Sinne distanziert sich die Redaktion/der Betreiber von den Inhalten in diesem Diskussionsforum. KMM behält sich insbesondere vor, gegen geltendes Recht verstoßende, den guten Sitten oder der Netiquette widersprechende bzw. dem Ansehen von KMM zuwiderlaufende Beiträge zu löschen, diesbezüglichen Schadenersatz gegenüber dem betreffenden User geltend zu machen, die Nutzer-Daten zu Zwecken der Rechtsverfolgung zu verwenden und strafrechtlich relevante Beiträge zur Anzeige zu bringen (siehe auch AGB ).",
            "pubDate": "2023-07-21 10:41:29",
            "image_url": "https://imgl.krone.at/scaled/2986603/v81bd40/full.jpg",
            "source_id": "krone",
            "category": [
                "top"
            ],
            "country": [
                "austria"
            ],
            "language": "german"
        },
        {
            "title": "India's Richest MLAs: कर्नाटकचे उपमुख्यमंत्री D K Shivakumar ठरले देशातील सर्वात श्रीमंत आमदार: 1,400 कोटींहून अधिक संपत्ती",
            "link": "https://marathi.latestly.com/india/news/indias-richest-mlas-karnataka-deputy-chief-minister-d-k-shivakumar-becomes-countrys-richest-mla-wealth-over-1400-crores-478254.html",
            "keywords": null,
            "creator": null,
            "video_url": null,
            "description": "अहवालानुसार, पश्चिम बंगालमधील सिंधू मतदारसंघातील निर्मल कुमार धारा हे सर्वात गरीब आमदार आहेत, ज्यांची संपत्ती फक्त 1,700 रुपये आहे.",
            "content": "काँग्रेसचे (Congress) सर्वोच्च नेते आणि कर्नाटकचे उपमुख्यमंत्री डीके शिवकुमार (D K Shivakumar) हे देशातील सर्वात श्रीमंत नेत्यांच्या यादीत पहिल्या क्रमांकावर आहेत. ते देशातील सर्वात श्रीमंत आमदार (India’s Richest MLA) आहेत. त्याचवेळी पश्चिम बंगालमधील भाजपचे आमदार निर्मल कुमार धारा हे सर्वात गरीब आमदार आहेत. त्यांची एकूण मालमत्ता फक्त रु.1700 आहे. असोसिएशन फॉर डेमोक्रॅटिक रिफॉर्म्स (ADR) आणि नॅशनल इलेक्शन वॉच (NEW)च्या अहवालानुसार, कर्नाटक प्रदेश काँग्रेस कमिटीचे अध्यक्ष डीके शिवकुमार हे 1,413 कोटी रुपयांच्या संपत्तीसह देशातील सर्वात श्रीमंत आमदार आहेत. 2023 मध्ये निवडणूक आयोगाला दिलेल्या प्रतिज्ञापत्रात शिवकुमार यांनी सांगितले होते की, त्यांच्याकडे एकूण 273 कोटी रुपयांची स्थावर आणि 1,140 कोटी रुपयांची जंगम मालमत्ता आहे. विशेष म्हणजे, टॉप 20 श्रीमंत आमदारांपैकी 12 सर्वोच्च पदे कर्नाटकातील आमदारांकडे आहेत. एडीआरच्या अहवालात असे दिसून आले आहे की, कर्नाटकातील 14 टक्के आमदार अब्जाधीश आहेत, त्यांची संपत्ती प्रत्येकी 100 कोटी किंवा त्याहून अधिक आहे. कर्नाटकातील आमदारांची सरासरी मालमत्ता 64.3 कोटी रुपये आहे. (हेही वाचा: World's Most Affordable Pizza: भारतातील महागाईचा सामना करण्यासाठी Domino's ने सादर केला 'जगातील सर्वात परवडणारा पिझ्झा'; जाणून घ्या किंमत ) अपक्ष आमदार आणि उद्योगपती केएच पुट्टास्वामी गौडा 1,267 कोटी रुपयांच्या संपत्तीसह श्रीमंत आमदारांच्या यादीत दुसऱ्या क्रमांकावर आहेत. तिसऱ्या क्रमांकावर कर्नाटक विधानसभेतील काँग्रेसचे सर्वात तरुण आमदार प्रियकृष्ण आहेत, ज्यांचे वय 39 वर्षे आहे. त्यांच्याकडे 1,156 कोटी रुपयांची संपत्ती आहे. प्रियकृष्ण यांचे वडील एम कृष्णप्पा यांचे कर्नाटकातील अव्वल अब्जाधीशांच्या यादीत 18 वे स्थान आहे. खाण उद्योगपती गली जनार्दन रेड्डी या यादीत 23 व्या क्रमांकावर आहेत. देशातील 28 राज्ये आणि दोन केंद्रशासित प्रदेशांतील 4,001 विद्यमान आमदारांचा समावेश असलेला हा अहवाल देशभरातील राजकारण्यांच्या आर्थिक बाबींवर प्रकाश टाकतो. अहवालानुसार, पश्चिम बंगालमधील सिंधू मतदारसंघातील निर्मल कुमार धारा हे सर्वात गरीब आमदार आहेत, ज्यांची संपत्ती फक्त 1,700 रुपये आहे. निर्मल कुमार हे भाजपचे आमदार आहेत. याआधी 2021 मध्ये ते टीएमसीच्या गढ सिंधू जागेवरून टीएमसी उमेदवार रुणू मेटे यांचा पराभव करून आमदार म्हणून निवडून आले आहेत.",
            "pubDate": "2023-07-21 10:39:20",
            "image_url": null,
            "source_id": "latestly",
            "category": [
                "top"
            ],
            "country": [
                "india"
            ],
            "language": "Marathi"
        },
        {
            "title": "Molly McCann was given 'Meatball' nickname after working in Subway, loves Guinness and co-owns a new Italian restaurant... but she has weight cutting and diet down to a fine art as she hits scales ahead of UFC London",
            "link": "https://www.dailymail.co.uk/sport/mma/article-12323203/Headline-goes-here.html?ns_mchannel=rss&ns_campaign=1490&ito=1490",
            "keywords": null,
            "creator": null,
            "video_url": null,
            "description": "You might expect a fighter nicknamed 'Meatball' to struggle when it comes to hitting the mark on the UFC scales. But Molly McCann, who clocked in at 125-pounds on the dot on Friday, is a professional.",
            "content": "Molly McCann was given 'Meatball' nickname after working in Subway, loves Guinness and co-owns a new Italian restaurant... but she has weight cutting and diet down to a fine art as she hits scales ahead of UFC London Molly McCann was given 'Meatball' nickname when she worked at Subway She likes to indulge outside of training camps and co-owns Italian restaurant But 'Meatball' now has weight cutting and dieting down to a fine art By Will Griffee For Mailonline Updated: 11:43, 21 July 2023 e-mail 1 View comments You might expect a fighter nicknamed 'Meatball' to struggle when it comes to hitting the mark on the UFC scales. But Molly McCann, who clocked in at 125-pounds on the dot on Friday morning ahead of her co-main event in London, has weight cutting and diet down to a fine art - only cheated once at Paddy Pimblett's wedding . It hasn't always been so easy for McCann, who previously described herself as a 'skinny fat thing' and was given the nickname 'Meatball' when she worked at Subway, long before she emerged as a cherished fan favourite in the UFC. In fact, she missed weight on her UFC debut and had to sacrifice 20 per cent of her purse as punishment. It embarrassed her at the time and said: 'I won't give you an excuse, I have never missed weight in 29 fights, and today is the first time I have. On my part I'd like to apologise, I didn't give up, I stayed cutting until the final moment. Molly McCann made weight on Friday morning ahead of her co-main event at UFC London 'Meatball' now co-owns her own Italian restaurant in Liverpool called Polpetta McCann has diet and weight cutting down to a fine art and has only missed the mark once The co-maineventers Molly McCann and Tom Aspinall have weighed in ahead of UFC Fight night at the O2 Arena ¿¿ #UFCLondon pic.twitter.com/uRYXf7fTj2 — Mail Sport (@MailSport) July 21, 2023 'I would also like to apologise to the fans. No excuses, the fight goes ahead and tomorrow I get to make up for the lack of professionalism.' And that was the one only one blot on her otherwise spotless copybook. Outside of training camps, McCann is known to like a Guinness and a night out, all part of the relatable charm that has made her so popular. McCann recently told the Telegraph which super-power she'd choose, saying: 'To teleport. I’d want to go to the Guinness Storehouse in Dublin and have a nice pint. That’s where I want to be right now. I always love a good Guinness. And of her dream dinner: 'I’d have pil pil prawns to start and my main would be carbonara – I love pasta. Dessert would be something like cookie dough. 'I’d invite Gordon Ramsay or Gino D’Acampo because we’d end up having a laugh. Me and Gino would definitely have a laugh – we wouldn’t be able to understand each other.' She also recently founded an Italian restaurant in Liverpool called 'Polpetta' that she co-owns. At the launch event she told the Echo: 'Ten years ago, I was working in the Subway on Bromley Street and it's where I got my name. Looking at this now, I'm just completely blown away by the city showing up for me. 'This isn't just a flash in the pan. [Joel and I] worked so hard on this, on brand, the menu, the ingredients the taste, and we've brought the best little group of chefs together that we can find. It's really nice to know that the city has shown up to support me like this. McCann missed weight on her UFC debut but has never repeated the same mistake McCann, pictured after a win with Paddy Pimblett last year, is in elite fighting shape The 33-year-old added: 'We went for a drink and we came for a Guinness. We actually wanted to open a butcher's, something like Molly's meats house, but then we thought, 'What's was our favourite food?' and it's Italian - I'm the meatball, let's do this. 'We'd meet every Thursday in Punch Tarmey's for a Guinness and we'd come up with a little bit more on a little bit more.' Avoiding too much over-indulgence on her own produce and steering clear of the Guinness is of course key to McCann getting in tip top shape during training camps. She lit up London twice last year with two incredible knockouts coming from spinning elbows and is gunning for the same result against Julija Stoliarenko on Saturday night. Her weight-cutting has developed over the years and McCann is now guided by a specialist company called Applied Nutrition. 'Sports science changed my life in a really positive way,' she explains. 'I literally felt that I'd hit the jackpot, my mental health was in the bin after losing my first fight but sports science brought me back. 'Previously if I didn't feel like I was absolutely exhausted after every session then I didn't think I was training hard enough. 'Now I know I was putting my body under too much stress and not recovering well. 'Normally I'd cut 14lbs in fluid on fight week. I was a skinny fat thing, but to look at me you'd still think I was in good shape. 'I made the weight the night before with none of that. I have to credit all the staff for getting me in that shape.' Now the weight cut is a streamlined process and where some fighters have to wrap themselves in foil in a sauna and brutalise their bodies to sweat down to the correct limit, McCann yesterday spoke about how she was even able to eat carbohydrates the day before the weigh-ins. The Liverpool fan favourite was blown away by the reception to her Italian restaurant opening McCann was seen drinking whiskey from the bottle after her victory last year Away from the rigorous discipline in training camp and calories counted, McCann is the life of the party when the shackles can come off. She famously yelled into the mic after a win: 'I just want a bevvy, lad!' And she started downing a bottle of Howler Head whiskey after her win against Luana Carolina last year, thrilling the crowd. 'Meatball' still had the bottle with her in the post-fight press conference, admitting she was 'bladdered', alongside Paddy Pimblett, who was scoffing a pizza. In the hours ahead, McCann will be rehydrating and fuelling up for the battle ahead. It will be her first event co-main event spot on a UFC card and the spotlight is shining ever brighter at the O2 Arena. The venue has been a happy hunting ground for McCann in the past and she'll be hoping to devour Stoliarenko before heading back to Liverpool to continue the feasting. Share or comment on this article: Molly McCann was given 'Meatball' nickname after working in Subway, loves Guinness and co-owns a new Italian restaurant... but she has weight cutting and diet down to a fine art as she hits scales ahead of UFC London e-mail Add comment Comments 1 Share what you think Newest Oldest Best rated Worst rated View all The comments below have not been moderated. View all The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline. Add your comment Enter your comment By posting your comment you agree to our house rules . Submit Comment Clear Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual. No Yes Close Do you want to automatically post your MailOnline comments to your Facebook Timeline? Your comment will be posted to MailOnline as usual We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook. You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy .",
            "pubDate": "2023-07-21 10:10:52",
            "image_url": "https://i.dailymail.co.uk/1s/2023/07/21/10/73464261-0-image-a-4_1689932055879.jpg",
            "source_id": "dailymailuk",
            "category": [
                "sports"
            ],
            "country": [
                "united kingdom"
            ],
            "language": "english"
        },
        {
            "title": "Shefali Shah pens heartfelt note, shares pics from son Aryaman Shah's graduation ceremony: ‘Bursting with pride and joy’",
            "link": "https://www.hindustantimes.com/entertainment/bollywood/shefali-shah-son-aryaman-graduation-ceremony-101689931348658.html",
            "keywords": null,
            "creator": null,
            "video_url": null,
            "description": "Shefali Shah is a proud mom. She penned a note to celebrate her son Aryaman Shah's graduation ceremony. Check out the family pictures.",
            "content": "Shefali Shah penned a heartwarming note on Instagram after her son Aryaman Shah's graduation ceremony. She shared a bunch of pictures from her son's convocation and called it ‘one of the most important and proud moments’ of a parents life. (Also read: Shefali Shah says people play her song Sapne Mein Milti Hai to annoy her: ‘Every time I went anywhere...' ) Shefali Shah shared a bunch of pictures from her son's graduation ceremony. Shefali Shah's Instagram post Shefali took to Instagram on Friday to share pictures of her son Aryaman Shah's convocation ceremony, which also featured producer-husband Vipul Shah and their son Maurya. In the pictures, Aryaman can be seen in his graduation robe as Shefali smiles at him. She wrote in her caption, \"When my kids were babies, each moment was a new achievement. Their first flip over on their tummy, the first time they crawled, their first steps, first words. To the first time they tied their shoe laces. Many firsts and each one as special as the other. Then came the first day of toddlers school, fear rolling down through tears for them and me, then the colours, alphabets, poems, friends... with them I grew.\" View this post on Instagram A post shared by Shefali Shah (@shefalishahofficial) Shefali's heartfelt reaction The Darlings actor then went on to add how it felt like she was crossing a 'milestone' with her son as he graduated. She further added in the caption, “But as they grew older there weren’t very many firsts, yet each grade, each goal scored, each medal won, each meal they cooked, each laundry they did was as important. One more step towards coming on their own.” She further wrote, \"And here we are today, celebrating one of the most important and proud moments of a parents life, our sunshine boy’s graduation. I don’t know if it means as much to him, as it does to us. But as I saw him clean shaved, looking so handsome and royal in his robe, fiddling with the ill fitting graduation cap, seeming cool as a cucumber like it was no big deal... I realised I was crossing another milestone with him.\" Bursting with pride and joy The actor then added that how she was 'bursting with pride and joy' when her son was receiving the degree. \"Winning an accolade much more magnificent than any I have ever won. But our young man is still my little baby. He searched for us from the stage, smiled blushingly and took instructions from our gestures (across a hall filled with hundreds) to readjust his crown. Smiled, tipped his hat, shook hands with the chancellor, received his graduation certificate with pride and humility. Of course I have waited for this day and dreamt of it innumerable times but to be there watching him sprout his wings I flew higher than I can ever explain. Bursting with pride and joy that only my kids can bring... He then showed us around his campus, library, classrooms his first accommodation with a common kitchen everything. We planned on going for a very nice celebratory dinner but by the time we did go everything had shut. We luckily found a hole in the wall take away pizza place, we stood together on the street in the square sharing the food. It couldn’t have been a better celebration even if we tried. Because any moment no matter how special or ordinary becomes priceless and precious because of my babies and I truly truly feel blessed by them.\" Shefali Shah was last seen in a special appearance in Neeyat, which released earlier this month. Her last release was the film Doctor G with Ayushmann Khurrana. Her 1998 film Satya recently completed 25 years of its release. Get more updates from Bollywood , Hollywood , Music and Web Series along with Latest Entertainment News at Hindustan Times. SHARE THIS ARTICLE ON ABOUT THE AUTHOR HT Entertainment Desk Dedicated professionals who write about cinema and television in all their vibrancy. Expect views, reviews and news. ...view detail Topics Shefali Shah",
            "pubDate": "2023-07-21 09:46:07",
            "image_url": "https://www.hindustantimes.com/ht-img/img/2023/07/21/1600x900/shefali_1689931793869_1689931794225.jpg",
            "source_id": "hindustantimes",
            "category": [
                "entertainment"
            ],
            "country": [
                "india"
            ],
            "language": "english"
        },
        {
            "title": "Hugely popular restaurant in Glasgow announces exciting shake-up – and Barbie fans will love it",
            "link": "https://www.thescottishsun.co.uk/money/10984211/di-maggios-glasgow-shake-up-barbie-movie/",
            "keywords": [
                "Business",
                "Money",
                "Barbie",
                "Food and drink"
            ],
            "creator": [
                "Anita Markoff"
            ],
            "video_url": null,
            "description": null,
            "content": "A HUGELY popular restaurant in Glasgow has announced an exciting shake-up - and Barbie fans are going to love it. Italian favourite Di Maggio's has launched a pink-themed menu to celebrate the release of the summer blockbuster. 4 The Barbie movie is set to hit cinemas this weekend Credit: AP 4 Di Maggio's is launching a special pink menu to celebrate the Barbie film 4 Customers can enjoy sweet treats before screenings in Glasgow this weekend 4 Di Maggio's in Glasgow will offer a Barbie-themed twist for customers Credit: The Sun The live-action Barbie film has been highly-anticipated, with opening weekend tickets selling out across Glasgow . And Di Maggio's is in on the hype. Their new \"Carbie\" menu will be available for customers for one week, from July 21 to 28. It boasts bright pink waffles, a sweet Carbie pizza , and a Pinkydink Shake garnished with sprinkles. in Money FOOD FOR THOUGHT Restaurant owners lift lid on cancellations across sector BAY BARGAIN £4.5m seaside mansion could be yours for £10... and it comes mortgage free The Ken out of Ten coloured waffles will be topped with an odd assortment of fried chicken, strawberry maple syrup and cotton candy. The dessert pizza will satisfy sugar lovers with its strawberry and white chocolate sauce, marshmallows and fresh strawberries. And diners will have the chance to win a pair of tickets for the Barbie movie if they enter a competition on the restaurant's social media pages. DRG head of marketing Nadine Carmichael said: \"It’s amazing to see that the Barbie film, and of course Oppenheimer, are bringing people back to the cinema - there’s a real buzz around the city centre. Most read in Business BASKET CASE Supermarkets told to make major change so shoppers can save more money LEASE OF LIFE Global jewellery retailer to open new store on busy Glasgow shopping street DREAM I run a business in Scotland - I screamed when I got asked to work on Barbie movie IT'S ASDA PRICE Asda owner rejects claim supermarket profiteered from ripping off drivers \"For weeks, anytime I’ve walked around Glasgow I’ve seen people dressed in all pink. \"We wanted to capture the imagination and excitement in a delicious menu. \"We’re looking forward to seeing everyone sitting down with their family and friends dressed in Barbie outfits to enjoy the Carbie menu before the film!\" Greta Gerwig’s Barbie hits cinemas today and follows Barbie and Ken as they leave the seemingly perfect world of Barbie Land to discover what it is like living like humans. We pay for your stories and videos! Do you have a story or video for The Scottish Sun? Email us at scoop@thesun.co.uk or call 0141 420 5200",
            "pubDate": "2023-07-21 09:40:14",
            "image_url": null,
            "source_id": "thescottishsun",
            "category": [
                "top"
            ],
            "country": [
                "united kingdom"
            ],
            "language": "english"
        }
    ],
    "nextPage": "16899324140603b41013c7700e6410b93e1a5321b7"
}
